yearnext/ysf/bsp/stm32f10x/map/map_uart.c
	return HAL_ERR_NONE;
}

/**
 *******************************************************************************
 * @brief       disable uart
 * @param       [in/out]  *dev            device block
 * @return      [in/out]  HAL_ERR_NONE    set finish
 * @note        None
 *******************************************************************************
 */
__INLINE hal_err_t Hal_Uart_Close(struct Hal_Uart_Device *dev)
{
    hal_assert(IS_PTR_NULL(dev));
    
	return Map_Uart_Close(dev->Port);
}

/**
 *******************************************************************************
 * @brief       uart port switch
 * @param       [in/out]  *config         device config block
 * @return      [in/out]  HAL_ERR_NONE    set finish
 * @note        None
 *******************************************************************************
 */
__STATIC_INLINE
void _Uart_Port_Switch(struct Hal_Uart_Device *dev)
{
    switch (dev->Port)
    {
        case MCU_UART_1:
            if (dev->Group == 0)
            {
                GPIO_PinRemapConfig(GPIO_Remap_USART1, DISABLE);
            }
            else
            {
                GPIO_PinRemapConfig(GPIO_Remap_USART1, ENABLE);
            }
            break;
        case MCU_UART_2:
            if (dev->Group == 0)
            {
                GPIO_PinRemapConfig(GPIO_Remap_USART2, ENABLE);
            }
            else
            {
                GPIO_PinRemapConfig(GPIO_Remap_USART2, DISABLE);
            }
            break;
        case MCU_UART_3:
            if (dev->Group == 0)
            {
                GPIO_PinRemapConfig(GPIO_PartialRemap_USART3, DISABLE);
                GPIO_PinRemapConfig(GPIO_FullRemap_USART3, DISABLE);
            }
            else if (dev->Group == 1)
            {
                GPIO_PinRemapConfig(GPIO_FullRemap_USART3, DISABLE);
                GPIO_PinRemapConfig(GPIO_PartialRemap_USART3, ENABLE);
            }
            else
            {
                GPIO_PinRemapConfig(GPIO_PartialRemap_USART3, DISABLE);
                GPIO_PinRemapConfig(GPIO_FullRemap_USART3, ENABLE);
            }
            break;
        default:
            break;
    }
}

/**
 *******************************************************************************
 * @brief       uart gpio init
 * @param       [in/out]  *config         set param
 * @return      [in/out]  HAL_ERR_NONE    set finish
 * @note        None
 *******************************************************************************
 */
__STATIC_INLINE
void _Uart_GPIO_Init(struct Hal_Uart_Device *dev)
{
    struct Hal_GPIO_Device TxPort;
    struct Hal_GPIO_Device RxPort;
    
    TxPort.IO = GPIO_HS_OUTPUT;
    TxPort.Mode = GPIO_AF_PUSH_PULL_MODE;

    RxPort.IO = GPIO_HS_OUTPUT;
    RxPort.Mode = GPIO_PULL_UP_DOWN_MODE;
                    
    switch (dev->Port)
    {
        case MCU_UART_1:
            if (dev->Group == 0)
            {
                TxPort.Port = MCU_PORT_A;
                TxPort.Pin  = MCU_PIN_9;
                
                RxPort.Port = MCU_PORT_A;  
                RxPort.Pin  = MCU_PIN_10;
            }
            else
            {
                TxPort.Port = MCU_PORT_B;
                TxPort.Pin  = MCU_PIN_6;
                
                RxPort.Port = MCU_PORT_B;  
                RxPort.Pin  = MCU_PIN_7;
            }
            break;
        case MCU_UART_2:
            if (dev->Group == 0)
            {
                TxPort.Port = MCU_PORT_A;
                TxPort.Pin  = MCU_PIN_2;
                
                RxPort.Port = MCU_PORT_A;  
                RxPort.Pin  = MCU_PIN_3;
            }
            else
            {
                TxPort.Port = MCU_PORT_D;
                TxPort.Pin  = MCU_PIN_5;
                
                RxPort.Port = MCU_PORT_D;  
                RxPort.Pin  = MCU_PIN_6;
            }
            break;
        case MCU_UART_3:
            if (dev->Group == 0)
            {
                TxPort.Port = MCU_PORT_B;
                TxPort.Pin  = MCU_PIN_10;
                
                RxPort.Port = MCU_PORT_B;  
                RxPort.Pin  = MCU_PIN_11;
            }
            else if (dev->Group == 1)
            {
                TxPort.Port = MCU_PORT_C;
                TxPort.Pin  = MCU_PIN_10;
                
                RxPort.Port = MCU_PORT_C;  
                RxPort.Pin  = MCU_PIN_11;
            }
            else
            {
                TxPort.Port = MCU_PORT_D;
                TxPort.Pin  = MCU_PIN_8;
                
                RxPort.Port = MCU_PORT_D;  
                RxPort.Pin  = MCU_PIN_9;
            }
            break;
        default:
            break;
    }
    
    Hal_GPIO_Open(&TxPort);
    Hal_GPIO_Init(&TxPort);
    
    Hal_GPIO_Open(&RxPort);
    Hal_GPIO_Init(&RxPort);
    
    _Uart_Port_Switch(dev);
}

/**
 *******************************************************************************
 * @brief       init uart
 * @param       [in/out]  port            uart id
 * @param       [in/out]  *config         set param
 * @return      [in/out]  HAL_ERR_NONE    set finish
 * @note        None
 *******************************************************************************
 */
hal_err_t Map_Uart_Init(uint8_t port, struct Hal_Uart_Device *dev)
{
    hal_assert(IS_UART_PORT_INVAILD(port));
    hal_assert(IS_PTR_NULL(config));
    
    USART_InitTypeDef USART_InitStructure;
    NVIC_InitTypeDef NVIC_InitStructure;
    
    //< init uart gpio
    _Uart_GPIO_Init(dev);
    
    //< init uart baud rate
	USART_InitStructure.USART_BaudRate = dev->Baud;
    
    //< init uart word len
    if(dev->WordLen == MCU_UART_WORD_LEN_8B)
    {
        USART_InitStructure.USART_WordLength = USART_WordLength_8b;
    }
    else
    {
        USART_InitStructure.USART_WordLength = USART_WordLength_9b;
    }
    
    //< set uart stop bits
    if(dev->StopBits == MCU_UART_STOP_BITS_0_5)
    {
        USART_InitStructure.USART_StopBits = USART_StopBits_0_5;
    }
    else if(dev->StopBits == MCU_UART_STOP_BITS_1)
    {
        USART_InitStructure.USART_StopBits = USART_StopBits_1;
    }
    else if(dev->StopBits == MCU_UART_STOP_BITS_1_5)
    {
        USART_InitStructure.USART_StopBits = USART_StopBits_1_5;
    }
    else
    {
        USART_InitStructure.USART_StopBits = USART_StopBits_2;
    }
    
    //< set uart parity
	if(dev->Parity == MCU_UART_PARTY_NONE)
    {
        USART_InitStructure.USART_Parity = USART_Parity_No;
    }
    else if(dev->Parity == MCU_UART_PARTY_EVEN)
    {
        USART_InitStructure.USART_Parity = USART_Parity_Even;
    }
    else
    {
        USART_InitStructure.USART_Parity = USART_Parity_Odd;
    }
    
    //< init uart mode
    USART_InitStructure.USART_Mode = 0;
    
    //< set uart tx state
    if(dev->TxConfig != MCU_UART_DISABLE_TX)
    {
        USART_InitStructure.USART_Mode    = USART_Mode_Tx;
    }
    
    //< set uart rx state
    if(dev->RxConfig == MCU_UART_DISABLE_RX)
    {
        USART_InitStructure.USART_Mode   |= USART_Mode_Rx;
    }

    //< disable hardware flow control
    USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_None;

    //< config uart call back
    UartTxCallback[port].Callback = dev->TxCallback.Callback;
    UartTxCallback[port].Param    = dev->TxCallback.Param;
    UartRxCallback[port].Callback = dev->RxCallback.Callback;
    UartRxCallback[port].Param    = dev->RxCallback.Param;
    
    //< init uart
    USART_DeInit(Uart[port]);
    USART_Init(Uart[port], &USART_InitStructure);
    
    if(dev->TxConfig == MCU_UART_ENABLE_TX_ISR)
    {
        USART_ClearITPendingBit(Uart[port], USART_IT_TC);
        USART_ITConfig(Uart[port], USART_IT_TC, ENABLE);
    }
    
