yearnext/ysf/bsp/stm32f10x/map/map_uart.c
    if(dev->RxConfig == MCU_UART_ENABLE_RX_ISR)
    {
        USART_ClearITPendingBit(Uart[port], USART_IT_RXNE);
        USART_ITConfig(Uart[port], USART_IT_RXNE, ENABLE);
    }
	
    NVIC_InitStructure.NVIC_IRQChannel = UartIrqn[port];
    NVIC_InitStructure.NVIC_IRQChannelSubPriority = 1;
    NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
    NVIC_Init(&NVIC_InitStructure);
    
    USART_Cmd(Uart[port], ENABLE);
    
    return HAL_ERR_NONE;
}

/**
 *******************************************************************************
 * @brief       init uart
 * @param       [in/out]  *dev            device block
 * @return      [in/out]  HAL_ERR_NONE    set finish
 * @note        None
 *******************************************************************************
 */
__INLINE hal_err_t Hal_Uart_Init(struct Hal_Uart_Device *dev)
{
    hal_assert(IS_PTR_NULL(dev));
        
    return Map_Uart_Init(dev->Port, dev);
}

/**
 *******************************************************************************
 * @brief       set uart tx call back
 * @param       [in/out]  port            uart id
 * @param       [in/out]  *callback       call back function
 * @param       [in/out]  *param          call back param
 * @return      [in/out]  HAL_ERR_NONE    set finish
 * @note        None
 *******************************************************************************
 */
hal_err_t Map_Uart_SetTxCallback(uint8_t port, void (*callback)(void*), void *param)
{
    hal_assert(IS_UART_PORT_INVAILD(port));
    
    UartTxCallback[port].Callback = callback;
    UartTxCallback[port].Param = param;
    
    return HAL_ERR_NONE;
}

/**
 *******************************************************************************
 * @brief       set uart tx call back
 * @param       [in/out]  *dev            device block
 * @param       [in/out]  *callback       call back function
 * @param       [in/out]  *param          call back param
 * @return      [in/out]  HAL_ERR_NONE    set finish
 * @note        None
 *******************************************************************************
 */
hal_err_t Hal_Uart_SetTxCallback(struct Hal_Uart_Device *dev, void (*callback)(void*), void *param)
{
    hal_assert(IS_PTR_NULL(dev));
    
    UartTxCallback[dev->Port].Callback = callback;
    UartTxCallback[dev->Port].Param = param;
    
    return HAL_ERR_NONE;
}

/**
 *******************************************************************************
 * @brief       set uart rx call back
 * @param       [in/out]  port            uart id
 * @param       [in/out]  *callback       call back function
 * @param       [in/out]  *param          call back param
 * @return      [in/out]  HAL_ERR_NONE    set finish
 * @note        None
 *******************************************************************************
 */
hal_err_t Map_Uart_SetRxCallback(uint8_t port, void (*callback)(void*, uint8_t), void *param)
{
    hal_assert(IS_UART_PORT_INVAILD(port));
    
    UartRxCallback[port].Callback = callback;
    UartRxCallback[port].Param = param;
    
    return HAL_ERR_NONE;
}


/**
 *******************************************************************************
 * @brief       set uart rx call back
 * @param       [in/out]  port            uart id
 * @param       [in/out]  *callback       call back function
 * @param       [in/out]  *param          call back param
 * @return      [in/out]  HAL_ERR_NONE    set finish
 * @note        None
 *******************************************************************************
 */
hal_err_t Hal_Uart_SetRxCallback(struct Hal_Uart_Device *dev, void (*callback)(void*, uint8_t), void *param)
{
    hal_assert(IS_UART_PORT_INVAILD(port));
    
    UartRxCallback[dev->Port].Callback = callback;
    UartRxCallback[dev->Port].Param = param;
    
    return HAL_ERR_NONE;
}

/**
 *******************************************************************************
 * @brief       deinit uart
 * @param       [in/out]  port            uart id
 * @return      [in/out]  HAL_ERR_NONE    set finish
 * @note        None
 *******************************************************************************
 */
hal_err_t Map_Uart_Fini(uint8_t port)
{
    hal_assert(IS_UART_PORT_INVAILD(port));
    
    USART_DeInit(Uart[port]);
    
    return HAL_ERR_NONE;
}

/**
 *******************************************************************************
 * @brief       deinit uart
 * @param       [in/out]  *dev            device block
 * @return      [in/out]  HAL_ERR_NONE    set finish
 * @note        None
 *******************************************************************************
 */
__INLINE hal_err_t Hal_Uart_Fini(struct Hal_Uart_Device *dev)
{
    hal_assert(IS_PTR_NULL(dev));
    
    return Map_Uart_Fini(dev->Port);
}

/**
 *******************************************************************************
 * @brief       enable uart tx
 * @param       [in/out]  *dev            device block
 * @return      [in/out]  HAL_ERR_NONE    set finish
 * @note        None
 *******************************************************************************
 */
hal_err_t Hal_Uart_TxConnect(struct Hal_Uart_Device *dev)
{
	hal_assert(IS_PTR_NULL(dev));

	Uart[dev->Port]->CR1 |= 0x08;
	Uart[dev->Port]->SR  &= ~0x40;
	Uart[dev->Port]->CR1 |= 0x40;

    dev->TxConfig         = MCU_UART_ENABLE_TX_ISR;
    
	return HAL_ERR_NONE;
}

/**
 *******************************************************************************
 * @brief       disable uart tx
 * @param       [in/out]  *dev            device block
 * @return      [in/out]  HAL_ERR_NONE    set finish
 * @note        None
 *******************************************************************************
 */
hal_err_t Hal_Uart_TxDisconnect(struct Hal_Uart_Device *dev)
{
	hal_assert(IS_PTR_NULL(dev));

	Uart[dev->Port]->CR1 &= ~0x08;
	Uart[dev->Port]->CR1 &= ~0x40;
	Uart[dev->Port]->SR  &= ~0x40;
    
    dev->TxConfig         = MCU_UART_DISABLE_TX;

	return HAL_ERR_NONE;
}

/**
 *******************************************************************************
 * @brief       enable uart rx
 * @param       [in/out]  *dev            device block
 * @return      [in/out]  HAL_ERR_NONE    set finish
 * @note        None
 *******************************************************************************
 */
hal_err_t Hal_Uart_RxConnect(struct Hal_Uart_Device *dev)
{
	hal_assert(IS_PTR_NULL(dev));

