yearnext/ysf/bsp/stm32f10x/map/map_uart.c
	Uart[dev->Port]->CR1 |= 0x04;
	Uart[dev->Port]->SR  &= ~0x20;
	Uart[dev->Port]->CR1 |= 0x20;
    
    dev->RxConfig         = MCU_UART_ENABLE_RX_ISR;

	return HAL_ERR_NONE;
}

/**
 *******************************************************************************
 * @brief       disable uart rx
 * @param       [in/out]  *dev            device block
 * @return      [in/out]  HAL_ERR_NONE    set finish
 * @note        None
 *******************************************************************************
 */
hal_err_t Hal_Uart_RxDisconnect(struct Hal_Uart_Device *dev)
{
	hal_assert(IS_PTR_NULL(dev));

	Uart[dev->Port]->CR1 &= ~0x04;
	Uart[dev->Port]->CR1 &= ~0x20;
	Uart[dev->Port]->SR  &= ~0x20;
    
    dev->RxConfig         = MCU_UART_DISABLE_RX;

	return HAL_ERR_NONE;
}

/**
 *******************************************************************************
 * @brief       get tx status
 * @param       [in/out]  *dev            device block
 * @return      [in/out]  HAL_ERR_NONE    set finish
 * @note        None
 *******************************************************************************
 */
hal_err_t Hal_Uart_GetTxCompletFlag(struct Hal_Uart_Device *dev, uint8_t *flag)
{
	hal_assert(IS_PTR_NULL(dev));
	hal_assert(IS_PTR_NULL(flag));

	*flag = (Uart[dev->Port]->SR & 0x40) ? (1) : (0);

	return HAL_ERR_NONE;
}

/**
 *******************************************************************************
 * @brief       clear tx flag
 * @param       [in/out]  *dev            device block
 * @return      [in/out]  HAL_ERR_NONE    set finish
 * @note        None
 *******************************************************************************
 */
hal_err_t Hal_Uart_ClrTxCompletFlag(struct Hal_Uart_Device *dev)
{
	hal_assert(IS_PTR_NULL(dev));

	Uart[dev->Port]->SR &= ~0x40;

	return HAL_ERR_NONE;
}

/**
 *******************************************************************************
 * @brief       get rx status
 * @param       [in/out]  *dev            device block
 * @return      [in/out]  HAL_ERR_NONE    set finish
 * @note        None
 *******************************************************************************
 */
hal_err_t Hal_Uart_GetRxCompletFlag(struct Hal_Uart_Device *dev, uint8_t *flag)
{
	hal_assert(IS_PTR_NULL(dev));
	hal_assert(IS_PTR_NULL(flag));

	*flag = (Uart[dev->Port]->SR & 0x20) ? (1) : (0);

	return HAL_ERR_NONE;
}

/**
 *******************************************************************************
 * @brief       clear uart rx status
 * @param       [in/out]  *dev            device block
 * @return      [in/out]  HAL_ERR_NONE    set finish
 * @note        None
 *******************************************************************************
 */
hal_err_t Hal_Uart_ClrRxCompletFlag(struct Hal_Uart_Device *dev)
{
	hal_assert(IS_PTR_NULL(dev));

	Uart[dev->Port]->SR &= ~0x20;

	return HAL_ERR_NONE;
}

/**
 *******************************************************************************
 * @brief       send data
 * @param       [in/out]  port            uart id
 * @param       [in/out]  sendData        send data
 * @return      [in/out]  HAL_ERR_NONE    set finish
 * @note        None
 *******************************************************************************
 */
hal_err_t Map_Uart_SendData(uint8_t port, uint8_t sendData)
{
    hal_assert(IS_UART_PORT_INVAILD(port));
    
    Uart[port]->DR = sendData;
    
    return HAL_ERR_NONE;
}

/**
 *******************************************************************************
 * @brief       send data
 * @param       [in/out]  *dev            device block
 * @param       [in/out]  sendData        send data
 * @return      [in/out]  HAL_ERR_NONE    set finish
 * @note        None
 *******************************************************************************
 */
hal_err_t Hal_Uart_SendData(struct Hal_Uart_Device *dev, uint8_t sendData)
{
    hal_assert(IS_PTR_NULL(dev));
    
    Uart[dev->Port]->DR = sendData;
    
    return HAL_ERR_NONE;
}

/**
 *******************************************************************************
 * @brief       receive data
 * @param       [in/out]  port            uart id
 * @param       [in/out]  *sendData       receive data            
 * @return      [in/out]  HAL_ERR_NONE    set finish
 * @note        None
 *******************************************************************************
 */
hal_err_t Map_Uart_ReceiveData(uint8_t port, uint8_t *sendData)
{
    hal_assert(IS_UART_PORT_INVAILD(port));
    hal_assert(IS_PTR_NULL(sendData));
    
    *sendData = Uart[port]->DR;
    
    return HAL_ERR_NONE;
}

/**
 *******************************************************************************
 * @brief       receive data
 * @param       [in/out]  *dev            device block
 * @param       [in/out]  *sendData       receive data            
 * @return      [in/out]  HAL_ERR_NONE    set finish
 * @note        None
 *******************************************************************************
 */
hal_err_t Hal_Uart_ReceiveData(struct Hal_Uart_Device *dev, uint8_t *sendData)
{
    hal_assert(IS_PTR_NULL(dev));
    hal_assert(IS_PTR_NULL(sendData));
    
    *sendData = Uart[dev->Port]->DR;
    
    return HAL_ERR_NONE;
}

/**
 *******************************************************************************
 * @brief       uart1 isr handle
 * @param       [in/out]  void           
 * @return      [in/out]  void
 * @note        None
 *******************************************************************************
 */
void USART1_IRQHandler(void)
{
    if (Uart[MCU_UART_1]->SR & 0x20)
    {
        if(!IS_PTR_NULL(UartTxCallback[MCU_UART_1].Callback))
        {
            UartTxCallback[MCU_UART_1].Callback(UartTxCallback[MCU_UART_1].Param);
        }
        
        Uart[MCU_UART_1]->SR &= ~0x40;
    }
    
    if (Uart[MCU_UART_1]->SR & 0x20)
    {
        if(!IS_PTR_NULL(UartRxCallback[MCU_UART_1].Callback))
        {
            UartRxCallback[MCU_UART_1].Callback(UartRxCallback[MCU_UART_1].Param, Uart[MCU_UART_1]->DR);
        }
        
        Uart[MCU_UART_1]->SR &= ~0x20;
    }
}

/**
 *******************************************************************************
 * @brief       uart2 isr handle
 * @param       [in/out]  void           
 * @return      [in/out]  void
 * @note        None
 *******************************************************************************
 */
void USART2_IRQHandler(void)
{
    if (Uart[MCU_UART_2]->SR & 0x40)
    {
        if(!IS_PTR_NULL(UartTxCallback[MCU_UART_2].Callback))
        {
            UartTxCallback[MCU_UART_2].Callback(UartTxCallback[MCU_UART_2].Param);
        }
        
        Uart[MCU_UART_2]->SR &= ~0x20;
    }
    
    if (Uart[MCU_UART_2]->SR & 0x20)
    {
        if(!IS_PTR_NULL(UartRxCallback[MCU_UART_2].Callback))
        {
            UartRxCallback[MCU_UART_2].Callback(UartRxCallback[MCU_UART_2].Param, Uart[MCU_UART_2]->DR);
        }
        
        Uart[MCU_UART_2]->SR &= ~0x20;
    }
}

/**
 *******************************************************************************
 * @brief       uart3 isr handle
 * @param       [in/out]  void           
 * @return      [in/out]  void
 * @note        None
 *******************************************************************************
 */
void USART3_IRQHandler(void)
{
    if (Uart[MCU_UART_3]->SR & 0x40)
    {
        if(!IS_PTR_NULL(UartTxCallback[MCU_UART_3].Callback))
        {
            UartTxCallback[MCU_UART_3].Callback(UartTxCallback[MCU_UART_3].Param);
        }
        
        Uart[MCU_UART_3]->SR &= ~0x40;
    }
    
    if (Uart[MCU_UART_3]->SR & 0x20)
    {
        if(!IS_PTR_NULL(UartRxCallback[MCU_UART_3].Callback))
        {
            UartRxCallback[MCU_UART_3].Callback(UartRxCallback[MCU_UART_3].Param, Uart[MCU_UART_3]->DR);
        }
        
