yearnext/ysf/bsp/stm32f10x/map/map_uart.c
        Uart[MCU_UART_3]->SR &= ~0x20;
    }
}

///**
// *******************************************************************************
// * @brief       uart4 isr handle
// * @param       [in/out]  void           
// * @return      [in/out]  void
// * @note        None
// *******************************************************************************
// */
//void UART4_IRQHandler(void)
//{
//    if (USART_GetITStatus(Uart[MCU_UART_4], USART_IT_TC) == SET)
//    {
//        if(!IS_PTR_NULL(UartTxCallback[MCU_UART_4].Callback))
//        {
//            UartTxCallback[MCU_UART_4].Callback(UartTxCallback[MCU_UART_4].Param);
//        }
//    }
//    
//    if (USART_GetITStatus(Uart[MCU_UART_4], USART_IT_RXNE) == SET)
//    {
//        if(!IS_PTR_NULL(UartRxCallback[MCU_UART_4].Callback))
//        {
//            UartRxCallback[MCU_UART_4].Callback(UartRxCallback[MCU_UART_4].Param, Uart[MCU_UART_4]->DR);
//        }
//    }  
//}
//
///**
// *******************************************************************************
// * @brief       uart5 isr handle
// * @param       [in/out]  void           
// * @return      [in/out]  void
// * @note        None
// *******************************************************************************
// */
//void UART5_IRQHandler(void)
//{
//    if (USART_GetITStatus(Uart[MCU_UART_5], USART_IT_TC) == SET)
//    {
//        if(!IS_PTR_NULL(UartTxCallback[MCU_UART_5].Callback))
//        {
//            UartTxCallback[MCU_UART_5].Callback(UartTxCallback[MCU_UART_5].Param);
//        }
//    }
//    
//    if (USART_GetITStatus(Uart[MCU_UART_5], USART_IT_RXNE) == SET)
//    {
//        if(!IS_PTR_NULL(UartRxCallback[MCU_UART_5].Callback))
//        {
//            UartRxCallback[MCU_UART_5].Callback(UartRxCallback[MCU_UART_5].Param, Uart[MCU_UART_5]->DR);
//        }
//    }
//}

void Hal_Uart_Test(void)
{
    struct Hal_Uart_Device uart = 
    {
        .Port = MCU_UART_2,
        .Baud = 115200,
        .Parity = MCU_UART_PARTY_NONE,
        .StopBits = MCU_UART_STOP_BITS_1,
        .WordLen = MCU_UART_WORD_LEN_8B,

        .RxConfig = MCU_UART_ENABLE_RX,
        .TxConfig = MCU_UART_ENABLE_TX,
    };
    
    uint16_t i;

    Hal_Uart_Open(&uart);
    Hal_Uart_Init(&uart);
    
    Hal_Uart_SendData(&uart, 0xFF);
    
    while(1)
    {
        for(i=0; i<100; i++);
    }
}

#endif

/** @}*/     /** map uart component */

/**********************************END OF FILE*********************************/
